app/controllers/movies_controller.rb

  def index
    @movies = Movie.all

    # Sorting by release date
    if params[:sort_by] == 'release_date_asc'
      @movies = @movies.order(release_date: :asc)
    elsif params[:sort_by] == 'release_date_desc'
      @movies = @movies.order(release_date: :desc)
    end

    # Sorting by rating
    if params[:sort_by] == 'rating_asc'
      @movies = @movies.order(rating: :asc)
---
SELECT "movies".* FROM "movies"
SELECT "movies".* FROM "movies" ORDER BY "movies"."release_date" DESC
SELECT "movies".* FROM "movies" ORDER BY "movies"."rating" DESC

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "rating" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["rating", "3.5"], ["updated_at", "2024-02-21 22:44:08.211654"], ["id", 8]]

  def destroy
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 1]]

    def set_movie
      @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]